PinkFluffyUnic0rn/stm32flight/main.c
/**
* @file main.c
* @brief Main file with entry point
*/

#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <ctype.h>

#include "stm32f4xx_hal.h"

#include "periphconf.h"
#include "settings.h"
#include "dsp.h"
#include "log.h"
#include "crc.h"
#include "runvals.h"
#include "timev.h"
#include "command.h"
#include "config.h"
#include "util.h"

#include "device.h"
#include "icm42688.h"
#include "dps368.h"
#include "esp8266.h"
#include "qmc5883l.h"
#include "crsf.h"
#include "w25.h"
#include "m10.h"
#include "uartconf.h"
#include "irc.h"
#include "dshot.h"

/**
* @brief handle for timer used for event scheduling
*/
TIM_HandleTypeDef *schedtim;

/**
* @brief External interrupt callback. It calls interrupt handlers
	from drivers for devices that use external interrupts.
* @param pin number of pin triggered the callback
* @return none
*/
void HAL_GPIO_EXTI_Callback(uint16_t pin)
{
	if (DEVITENABLED(Dev[DEV_ESP].status)) {
		Dev[DEV_ESP].interrupt(Dev[DEV_ESP].priv, &pin);
	}
}

/**
* @brief UART receive callback. It calls interrupt handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback
* @return none
*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(Dev[DEV_M10].status))
		Dev[DEV_M10].interrupt(Dev[DEV_M10].priv, huart);

	if (DEVITENABLED(Dev[DEV_CRSF].status))
		Dev[DEV_CRSF].interrupt(Dev[DEV_CRSF].priv, huart);

	if (DEVITENABLED(Dev[DEV_UART].status))
		Dev[DEV_UART].interrupt(Dev[DEV_UART].priv, huart);
}

/**
* @brief UART error callback. Calls UART error handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback.
* @return none
*/
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(Dev[DEV_CRSF].status))
		Dev[DEV_CRSF].error(Dev[DEV_CRSF].priv, huart);
}

void NMI_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);

	while (1) {}
}

void HardFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);
	
	while (1) {}
}

void MemManage_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);

	while (1) {}
}

void BusFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);
	
	while (1) {}
}

void UsageFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);

	while (1) {}
}

void error_handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, GPIO_PIN_SET);

	__disable_irq();
	while (1) {}
}

/**
* @brief Get battery voltage from ADC.
* @return battery voltage
*/
float batteryvoltage()
{
	ADC_HandleTypeDef *hadc;
	uint32_t v;

	hadc = pconf_hadcs + pconf_adcidx(ADC1);

	HAL_ADC_Start(hadc);
	HAL_ADC_PollForConversion(hadc, 1);

	v = HAL_ADC_GetValue(hadc);

	HAL_ADC_Stop(hadc);

	return (v / (float) 0xfff * BAT_SCALE);
}

/**
* @brief Get ESC current from ADC.
* @return battery current in amperes
*/
float esccurrent()
{
	ADC_HandleTypeDef *hadc;
	uint32_t v;
	
	hadc = pconf_hadcs + pconf_adcidx(ADC2);

	HAL_ADC_Start(hadc);
	HAL_ADC_PollForConversion(hadc, 1);

	v = HAL_ADC_GetValue(hadc);

	HAL_ADC_Stop(hadc);

	return (v / (float) 0xfff * St.adj.cursc + St.adj.curroff);
}

/**
* @brief Init HP206c barometer.
* @return none
*/
static void dps_init()
{
	struct dps_device d;

	d.hi2c = pconf_hi2cs + pconf_i2cidx(I2C1);
	d.rate = DPS_RATE_32;
	d.osr = DPS_OSR_16;

	if (dps_initdevice(&d, Dev + DEV_DPS) >= 0)
		uartprintf("DPS368 initilized\r\n");
	else
		uartprintf("failed to initilize DPS368\r\n");
}

/**
* @brief Init IRC tramp video transmitter.
* @return none
*/
static void irc_init()
{
	struct irc_device d;

	d.huart = pconf_huarts + pconf_uartidx(UART5);
	d.power = St.irc.power;
	d.frequency = St.irc.freq;

	if (irc_initdevice(&d, Dev + DEV_IRC) >= 0)
		uartprintf("IRC device initilized\r\n");
	else
		uartprintf("failed to initilize IRC device\r\n");
}

/**
* @brief Init ICM-42688-P IMU.
* @return none
*/
static void icm_init()
{
	struct icm_device d;

	d.hspi = pconf_hspis + pconf_spiidx(SPI1);
	d.gpio = GPIOC;
	d.pin = GPIO_PIN_13;

	d.gyroscale = ICM_1000DPS;
	d.gyrorate = ICM_GYRO8K;
	d.gyroorder = ICM_GYROORDER3;
	d.gyrolpf = ICM_GYROLPFLL;
	d.accelscale = ICM_4G;
	d.accelrate = ICM_ACCEL8K;
	d.accellpf = ICM_ACCELLPFLL;
	d.accelorder = ICM_ACCELORDER3;

	if (icm_initdevice(&d, Dev + DEV_ICM) >= 0)
		uartprintf("ICM-42688 initilized\r\n");
	else
		uartprintf("failed to initilize ICM-42688\r\n");
}

/**
* @brief Init QMC5883L magnetometer.
* @return none
*/
static void qmc_init()
{
	struct qmc_device d;
	
	d.hi2c = pconf_hi2cs + pconf_i2cidx(I2C1);
	d.scale = QMC_SCALE_8;
	d.rate = QMC_RATE_100;
	d.osr = QMC_OSR_512;

	if (qmc_initdevice(&d, Dev + DEV_QMC) >= 0)
		uartprintf("QMC5883L initilized\r\n");
	else
		uartprintf("failed to initilize QMC5883L\r\n");
}

/**
* @brief Init ESP8285.
* @return none
*/
static void espdev_init()
{
	struct esp_device d;

	d.hspi = pconf_hspis + pconf_spiidx(SPI2);
	d.csgpio = GPIOC;
	d.cspin = GPIO_PIN_0;
	d.rstgpio = GPIOC;
	d.rstpin = GPIO_PIN_14;
	d.bootgpio = GPIOC;
	d.bootpin = GPIO_PIN_15;
	d.busygpio = GPIOB;
	d.busypin = GPIO_PIN_15;
	d.intpin = GPIO_PIN_1;

	if (esp_initdevice(&d, Dev + DEV_ESP) < 0) {
		uartprintf("failed to initilize ESP8266\r\n");
		return;
	}

	uartprintf("ESP8266 initilized\r\n");
}

/**
* @brief Init ERLS receiver driver.
* @return none
*/
static void crsfdev_init()
{
	struct crsf_device d;

	d.huart = pconf_huarts + pconf_uartidx(USART2);

	if (crsf_initdevice(&d, Dev + DEV_CRSF) >= 0)
		uartprintf("CRSF device initialized\r\n");
	else
		uartprintf("failed to initialize CRSF device\r\n");
}

/**
* @brief Init W25Q onboard flash memory.
* @return none
*/
static void w25dev_init()
{
	struct w25_device d;

	d.hspi = pconf_hspis + pconf_spiidx(SPI1);
	d.gpio = GPIOB;
	d.pin = GPIO_PIN_3;

	if (w25_initdevice(&d, &Flashdev) < 0) {
		uartprintf("failed to initilize W25Q\r\n");
		return;
	}

	uartprintf("W25Q initilized\r\n");
}

/**
* @brief Init GNSS module.
* @return none
*/
static void m10dev_init()
{
	struct m10_device d;

	d.huart = pconf_huarts + pconf_uartidx(USART3);

