PinkFluffyUnic0rn/stm32flight/main.c
	if (m10_initdevice(&d, Dev + DEV_M10) < 0) {
		uartprintf("failed to initilize GPS device\r\n");
		return;
	}

	uartprintf("GPS device initilized\r\n");
}

/**
* @brief Init UART config connection.
* @return none
*/
static void uartdev_init()
{
	struct uart_device d;

	d.huart = pconf_huarts + pconf_uartidx(UART4);

	if (uart_initdevice(&d, Dev + DEV_UART) < 0) {
		uartprintf("failed to initilize UART device\r\n");
		return;
	}

	uartprintf("UART device initilized\r\n");
}

/**
* @brief Init DShot-300 output.
* @return none
*/
static void dshot_init()
{
	struct dshot_device d;



	d.htim[0] = pconf_htims + pconf_timidx(TIM1);
	d.htim[1] = pconf_htims + pconf_timidx(TIM1);
	d.htim[2] = pconf_htims + pconf_timidx(TIM1);
	d.htim[3] = pconf_htims + pconf_timidx(TIM1);

	d.timch[0] = TIM_CHANNEL_1;
	d.timch[1] = TIM_CHANNEL_2;
	d.timch[2] = TIM_CHANNEL_3;
	d.timch[3] = TIM_CHANNEL_4;

	if (dshot_initdevice(&d, Dev + DEV_DSHOT) >= 0)
		uartprintf("DShot300 initilized\r\n");
	else
		uartprintf("failed to initilize DShot300\r\n");
}

/**
* @brief Calculate tilt compensated heading direction
	using magnetometer readings, roll value and pitch value.
* @param r roll value
* @param p pitch value
* @param x magnetometer's X axis value
* @param y magnetometer's Y axis value
* @param z magnetometer's Z axis value
* @return tilt compensated heading
*/
float qmc_heading(float r, float p, float x, float y, float z)
{
	x = x * cosf(p) + y * sinf(r) * sinf(p)
		- z * cosf(r) * sinf(p);
	y = y * cosf(r) + z * sinf(r);

	return circf(atan2f(y, x) + St.adj.magdecl);
}

/**
* @brief Stabilization loop. Callback for TEV_PID periodic event.
	It is the place where is almost all work happening.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int stabilize(int ms)
{
	float ltm, lbm, rbm, rtm;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float vx, vy, vz;
	float gy, gx, gz;
	float ay, ax, az;
	float va;
	float ht;
	float dt;

	// debug pin switching
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4,
		!(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)));

	// emergency disarm happened
	if (Emergencydisarm) {
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// get time passed from last invocation of this calback function
	dt = ms / (float) TICKSPERSEC;

	// divide-by-zero protection
	dt = (dt < 0.000001) ? 0.000001 : dt;

	// update battery voltage
	writelog(LOG_BAT, dsp_getlpf(Lpf + LPF_BAT));

	// toggle arming indication led
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6,
		(En > 0.5) ? GPIO_PIN_SET : GPIO_PIN_RESET);

	// get accelerometer and gyroscope readings
	Dev[DEV_ICM].read(Dev[DEV_ICM].priv, &Imudata,
		sizeof(struct icm_data));

	// apply accelerometer offsets
	Imudata.afx += (Imudata.ft - 25.0) * St.adj.acctsc.x;
	Imudata.afy += (Imudata.ft - 25.0) * St.adj.acctsc.y;
	Imudata.afz += (Imudata.ft - 25.0) * St.adj.acctsc.z;
	Imudata.afx -= St.adj.acc0.x;
	Imudata.afy -= St.adj.acc0.y;
	Imudata.afz -= St.adj.acc0.z;

	// apply gyroscope offsets
	Imudata.gfx -= St.adj.gyro0.x;
	Imudata.gfy -= St.adj.gyro0.y;
	Imudata.gfz -= St.adj.gyro0.z;

	// write accelerometer and gyroscope values into log
	writelog(LOG_ACC_X, Imudata.afx);
	writelog(LOG_ACC_Y, Imudata.afy);
	writelog(LOG_ACC_Z, Imudata.afz);
	writelog(LOG_GYRO_X, Imudata.gfx);
	writelog(LOG_GYRO_Y, Imudata.gfy);
	writelog(LOG_GYRO_Z, Imudata.gfz);

	// update accelerometer temperature
	dsp_updatelpf(Lpf + LPF_IMUTEMP, Imudata.ft);

	// apply accelerometer offsets
	ax = dsp_updatelpf(Lpf + LPF_ACCX, Imudata.afx);
	ay = dsp_updatelpf(Lpf + LPF_ACCY, Imudata.afy);
	az = dsp_updatelpf(Lpf + LPF_ACCZ, Imudata.afz);

	// update vertical acceleration low-pass filter
	dsp_updatelpf(Lpf + LPF_THR, Imudata.afz);

	// convert gyroscope values into radians
	gx = deg2rad(dsp_updatelpf(Lpf + LPF_GYROX, Imudata.gfx));
	gy = deg2rad(dsp_updatelpf(Lpf + LPF_GYROY, Imudata.gfy));
	gz = deg2rad(dsp_updatelpf(Lpf + LPF_GYROZ, Imudata.gfz));

	// update complimenraty filter for roll axis and get next roll
	// value. First signal (value) is signal to be integrated: it's
	// the speed of the rotation around Y axis. Second signal is
	// signal to be low-pass filtered: it's the tilt value that is
	// calculated from acceleromer readings through some
	// trigonometry.
	roll = dsp_updatelpf(Lpf + LPF_ROLL,
		dsp_updatecompl(Cmpl + CMPL_ROLL, gy * dt,
			atan2f(-ax, sqrt(ay * ay + az * az)))
				- St.adj.att0.roll);

	// same as for roll but for different axes
	pitch = dsp_updatelpf(Lpf + LPF_PITCH,
		dsp_updatecompl(Cmpl + CMPL_PITCH, gx * dt,
			atan2f(ay, sqrt(ax * ax + az * az))) 
				- St.adj.att0.pitch);

	// update complimenraty filter for yaw axis and get next yaw
	// value. First signal is the speed of the rotation around Z
	// axis. Second signal is the heading value that is
	// calculated from magnetometer readings.
	yaw = dsp_updatelpf(Lpf + LPF_YAW,
		circf(dsp_updatecirccompl(Cmpl + CMPL_YAW, -gz * dt,
		qmc_heading(roll, -pitch,
			Qmcdata.fx, Qmcdata.fy, Qmcdata.fz)) 
			- St.adj.att0.yaw));

	// calculate gravity direction vector in IMU coordination system
	// using pitch and roll values;
	vx = cos(-pitch) * sin(-roll);
	vy = -sin(-pitch);
	vz = cos(-pitch) * cos(-roll);

	// update vertical acceleration using acceleration
	// vector to gravity vector projection
	va = (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz);

	dsp_updatelpf(Lpf + LPF_VAU, va);
	dsp_updatelpf(Lpf + LPF_VAPT1, va);
	dsp_updatelpf(Lpf + LPF_VAAVG, va);
	
	writelog(LOG_CUSTOM0, dsp_getlpf(Lpf + LPF_VAU));

	// update forward acceleration using acceleration
	// vector to gravity vector projection
	vx = sin(-roll) * sin(-pitch);
	vy = cos(-pitch);
	vz = cos(-roll) * sin(-pitch);

	dsp_updatelpf(Lpf + LPF_FA, (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz));

	// get pitch corrected value of the hover throttle
	ht = St.adj.hoverthrottle / (cosf(-pitch) * cosf(-roll));

	// if vertical acceleration is negative, most likely
	// quadcopter is upside down, perform emergency disarm
	if (dsp_getlpf(Lpf + LPF_THR) < -0.5) {
		Emergencydisarm = 1;
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// write roll, pitch and yaw values into log
	writelog(LOG_ROLL, roll);
	writelog(LOG_PITCH, pitch);
	writelog(LOG_YAW, yaw);

