PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

/**
* @brief Get readings from barometer. Callback for
	TEV_DPS periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int dpsupdate(int ms)
{
	struct dps_data hd;
	float alt;
	static float prevalt = 0.0;
	float dt;

	dt = ms / (float) TICKSPERSEC;

	dt = (dt < 0.000001) ? 0.000001 : dt;

	// if barometer isn't initilized, return
	if (Dev[DEV_DPS].status != DEVSTATUS_INIT)
		return 0;

	// read barometer values
	Dev[DEV_DPS].read(Dev[DEV_DPS].priv, &hd,
		sizeof(struct dps_data));

	// write barometer temperature and altitude values into log
	writelog(LOG_BAR_TEMP, hd.tempf);
	writelog(LOG_BAR_ALT, hd.altf);

	// update altitude low-pass filter and temperature reading
	alt = dsp_updatelpf(Lpf + LPF_ALT, hd.altf);
	dsp_updatelpf(Lpf + LPF_BARTEMP, hd.tempf);

	// calculate climb rate from vertical acceleration and
	// barometric altitude defference using complimentary filter
	dsp_updatecompl(Cmpl + CMPL_CLIMBRATE,
		9.80665 * (dsp_getlpf(Lpf + LPF_VAU) + Goffset - 1.0) * dt,
			(dsp_getcompl(Cmpl + CMPL_ALT) - prevalt) / dt);
	
	// calculate presice altitiude from climb rate and
	// barometric altitude using complimentary filter
	dsp_updatecompl(Cmpl + CMPL_ALT,
		dsp_getcompl(Cmpl + CMPL_CLIMBRATE) * dt,
		alt);
	
	prevalt = dsp_getcompl(Cmpl + CMPL_ALT);

	// write climbrate and altitude values into log
	writelog(LOG_CLIMBRATE, dsp_getcompl(Cmpl + CMPL_CLIMBRATE));
	writelog(LOG_ALT, dsp_getcompl(Cmpl + CMPL_ALT));

	return 0;
}

/**
* @brief Get readings from magnetomer. Callback for TEV_QMC
	periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int qmcupdate(int ms)
{
	// if magnetometer isn't initilized, return
	if (Dev[DEV_QMC].status != DEVSTATUS_INIT)
		return 0;

	// read magnetometer values
	Dev[DEV_QMC].read(Dev[DEV_QMC].priv, &Qmcdata,
		sizeof(struct qmc_data));

	// apply offsets to magnetometer values
	Qmcdata.fx = St.adj.magsc.x * (Qmcdata.fx + St.adj.mag0.x);
	Qmcdata.fy = St.adj.magsc.y * (Qmcdata.fy + St.adj.mag0.y);
	Qmcdata.fz = St.adj.magsc.z * (Qmcdata.fz + St.adj.mag0.z);

	// apply scaling to magnetometer values
	Qmcdata.fx += St.adj.magthrsc.x * dsp_getlpf(Lpf + LPF_AVGTHR);
	Qmcdata.fy += St.adj.magthrsc.y * dsp_getlpf(Lpf + LPF_AVGTHR);
	Qmcdata.fz += St.adj.magthrsc.z * dsp_getlpf(Lpf + LPF_AVGTHR);

	// write magnetometer values into log
	writelog(LOG_MAG_X, Qmcdata.fx);
	writelog(LOG_MAG_Y, Qmcdata.fy);
	writelog(LOG_MAG_Z, Qmcdata.fz);

	// update magnetometer values lpf
	dsp_updatelpf(Lpf + LPF_MAGX, Qmcdata.fx);
	dsp_updatelpf(Lpf + LPF_MAGY, Qmcdata.fy);
	dsp_updatelpf(Lpf + LPF_MAGZ, Qmcdata.fz);

	return 0;
}

/**
* @brief Update log frame. If buffer isn't full, just move
	buffer pointer, otherwise save buffer content into flash and
	set buffer pointer to 0.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int logupdate(int ms)
{
	updatelog();

	return 0;
}

/**
* @brief Send telemetry through ELRS.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int telesend(int ms)
{
	const char *attmodestr[] = {"ac", "st", "sp", "ps"};
	const char *yawmodestr[] = {"sp", "cs"};
	const char *altmodestr[] = {"tr", "cl", "al"};
	const char *am;

	Tele.bat = dsp_getlpf(Lpf + LPF_BAT);
	Tele.curr = dsp_getlpf(Lpf + LPF_CUR);

	// Determine battery series cells count using it voltage
	// and calculate it's remaining charge in percents
	if (Tele.bat < 6.0)
		Tele.batrem = (Tele.bat - 3.5) / 0.7;
	else if (Tele.bat < 9.0)
		Tele.batrem = (Tele.bat - 7.0) / 1.4;
	else if (Tele.bat < 13.5)
		Tele.batrem = (Tele.bat - 10.5) / 2.1;
	else if (Tele.bat < 18.0)
		Tele.batrem = (Tele.bat - 14) / 2.8;
	else
		Tele.batrem = (Tele.bat - 21) / 3.5;

	Tele.batrem = trimf(100.0 * Tele.batrem, 0.0, 100.0);

	Tele.lat = Gnss.lat + Gnss.latmin / 60.0;
	Tele.lon = Gnss.lon + Gnss.lonmin / 60.0;
	Tele.speed = Gnss.speed;
	Tele.course = Gnss.course;
	Tele.alt = Gnss.altitude;
	Tele.sats = Gnss.satellites;
	Tele.balt = dsp_getcompl(Cmpl + CMPL_ALT) - Alt0;
	Tele.vspeed = dsp_getcompl(Cmpl + CMPL_CLIMBRATE);
	Tele.roll = dsp_getlpf(Lpf + LPF_ROLL);
	Tele.pitch = dsp_getlpf(Lpf + LPF_PITCH);
	Tele.yaw = dsp_getlpf(Lpf + LPF_YAW);

	// fill flight mode string with arm state and
	// combination of stabilization modes codes
	if (Altmode == ALTMODE_ACCEL)
		am = altmodestr[0];
	else if (Altmode == ALTMODE_SPEED)
		am = altmodestr[1];
	else if (Altmode == ALTMODE_POS)
		am = altmodestr[2];
	else
		am = "---";

	snprintf((char *) Tele.mode, 14, "%c|%s|%s|%s",
		En > 0.5 ? 'a' : 'n',
		attmodestr[Speedpid ? 0 : 1],
		yawmodestr[Yawspeedpid ? 0 : 1], am);

	// in case of emergency disarming
	// set flight mode to "stopped"
	if (Emergencydisarm)
		strcpy((char *) Tele.mode, "stopped");

	Dev[DEV_CRSF].write(Dev[DEV_CRSF].priv, &Tele,
		sizeof(struct crsf_tele));

	return 0;
}

/**
* @brief Update battery voltage and current.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int powercheck(int ms)
{
	dsp_updatelpf(Lpf + LPF_BAT, batteryvoltage());
	dsp_updatelpf(Lpf + LPF_CUR, esccurrent());

	return 0;
}

/**
* @brief Move to next point in autopilot track.
* @return always 0
*/
int autopilotstep()
{
	Autopilottimer = 0;
	++Curpoint;

	return 0;
}

/**
* @brief Update control values when moving in autopilot mode.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int autopilotupdate(int ms)
{
	struct trackpoint *nextpoint;
	float dt;

	dt = ms / (float) TICKSPERSEC;
	
	if (!Autopilot || Pointscount == 0 || Curpoint < 0
			|| Curpoint >= Pointscount) {
		return 0;
	}

	nextpoint = Points + Curpoint + 1;
	if (nextpoint->type == AUTOPILOT_START)
		Autopilottimer = 0.0;
	else if (nextpoint->type == AUTOPILOT_TAKEOFF) {
		Thrust = Autopilottimer * nextpoint->takeoff.alt
			/ nextpoint->takeoff.t;
		
		Autopilottimer += dt;

		if (Autopilottimer > nextpoint->takeoff.t)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_HOVER) {
		Thrust = nextpoint->hover.alt;
		
		Yawtarget = atan2f(nextpoint->hover.x,
			nextpoint->hover.y);
		
		Autopilottimer += dt;

