PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

/**
* @brief Store data got from NMEA message.
* @param nd data got from GNSS device through NMEA protocol
* @return always 0
*/
int m10msg(struct m10_data *nd)
{
	// got only altitude and signal quality data from GGA messages.
	if (nd->type == M10_TYPE_GGA) {
		Gnss.altitude = nd->gga.alt;
		Gnss.quality = nd->gga.quality;
		Gnss.satellites = nd->gga.sats;

		return 0;
	}

	// other needed data is got from RMC
	// messages. Discard all other messages.
	if (nd->type != M10_TYPE_RMC)
		return 0;

	Gnss.time = nd->rmc.time;
	memcpy(Gnss.date, nd->rmc.date, 10);

	Gnss.latmin = nd->rmc.latmin;
	Gnss.lat = nd->rmc.lat;
	Gnss.latdir = (tolower(nd->rmc.latdir) == 'n')
		? LATDIR_N : LATDIR_S;

	Gnss.lonmin = nd->gga.lonmin;
	Gnss.lon = nd->rmc.lon;
	Gnss.londir = (tolower(nd->rmc.londir) == 'e')
		? LONDIR_E : LONDIR_W;

	Gnss.magvar = nd->rmc.magvar;
	Gnss.magvardir = (tolower(nd->rmc.magvardir) == 'e')
		? MAGVARDIR_E : MAGVARDIR_W;

	Gnss.speed = nd->rmc.speed;
	Gnss.course = nd->rmc.course;

	return 0;
}

/**
* @brief Entry point
* @return none
*/
int main(void)
{
	int elrsus;
	int i;

	// init stm32 periphery
	pconf_init(error_handler);

	// set initial status for all devices to prevent callback
	// calls on corresponding events before inittialization
	for (i = 0; i < DEV_COUNT; ++i)
		Dev[i].status = DEVSTATUS_NOINIT;

	// set microsecond delay timer
	delayinit(pconf_htims + pconf_timidx(TIM10));

	// set microsecond delay timer
	uartprintfinit(pconf_huarts + pconf_uartidx(UART4));

	// set scheduler timer
	schedtim = pconf_htims + pconf_timidx(TIM8);

	// reading settings from memory current
	// memory slot, which is 0 at start
	readsettings(Curslot);

	// init board's devices
	icm_init();
	qmc_init();
	espdev_init();
	crsfdev_init();

	w25dev_init();
	m10dev_init();
	uartdev_init();
	dps_init();
	irc_init();
	dshot_init();

	// initialize stabilization routine
	setstabilize(1);

	// initilize periodic events
	inittimev(Evs + TEV_PID, 0, PID_FREQ, stabilize);
	inittimev(Evs + TEV_CHECK, 0, CHECK_FREQ, checkconnection);
	inittimev(Evs + TEV_DPS, 1 * DPS_FREQ / 5, DPS_FREQ, dpsupdate);
	inittimev(Evs + TEV_QMC, 2 * QMC_FREQ / 5, QMC_FREQ, qmcupdate);
	inittimev(Evs + TEV_LOG, 0, St.log.freq, logupdate);
	inittimev(Evs + TEV_TELE, 3 * TELE_FREQ / 5, 
		TELE_FREQ, telesend);
	inittimev(Evs + TEV_POWER, 4 * POWER_FREQ / 5,
		POWER_FREQ, powercheck);
	inittimev(Evs + TEV_AUTOPILOT, 0, AUTOPILOT_FREQ,
		autopilotupdate);
	
	// initilize debug commands
	addcommand("r", rcmd);
	addcommand("info", infocmd);
	addcommand("flash", flashcmd);
	addcommand("system", systemcmd);
	addcommand("log", logcmd);
	addcommand("motor", motorcmd);
	addcommand("autopilot", autopilotcmd);
	addcommand("set", setcmd);
	addcommand("get", getcmd);
	addcommand("apply", applycmd);

	// initilize ERLS timer. For now ERLS polling is not a periodic
	// event and called as frequently as possible, so it needs this
	// separate timer.
	elrsus = 0;

	uartprintf("HERHER!\r\n");

	// main control loop
	while (1) {
		char cmd[CMDSIZE];
		struct crsf_data cd;
		struct m10_data nd;
		int c, i;

		// reset iteration time counter
		__HAL_TIM_SET_COUNTER(schedtim, 0);

		// poll for configuration and telemetry commands
		// from debug wifi connection
		if (Dev[DEV_ESP].read(Dev[DEV_ESP].priv, &cmd,
			CMDSIZE) >= 0) {
			runcommand(Dev + DEV_ESP, cmd);
		}

		// poll for configuration and telemtry commands
		// from debug uart connection
		if (Dev[DEV_UART].read(Dev[DEV_UART].priv, &cmd,
			UART_CMDSIZE) >= 0) {
			runcommand(Dev + DEV_UART, cmd);
		}

		// read the ELRS remote's packet
		if (Dev[DEV_CRSF].read(Dev[DEV_CRSF].priv, &cd,
			sizeof(struct crsf_data)) >= 0) {
			crsfcmd(&cd, elrsus);
			elrsus = 0;
		}

		// check the M10 messages
		if (Dev[DEV_M10].read(Dev[DEV_M10].priv, &nd,
			sizeof(struct m10_data)) >= 0) {
			m10msg(&nd);
		}

		// check all periodic events context's and run callbacks
		// if enough time passed. Reset their timers after.
		for (i = 0; i < TEV_COUNT; ++i) {
			if (checktimev(Evs + i)) {
				Evs[i].cb(Evs[i].ms);
				resettimev(Evs + i);
			}
		}

		// get microseconds passed in this iteration
		// one iteration duration should take at least
		// some time, 100us was choosen
		while ((c = __HAL_TIM_GET_COUNTER(schedtim)) < 1);

		// update periodic events timers
		for (i = 0; i < TEV_COUNT; ++i)
			updatetimev(Evs + i, c);

		// update ELRS timer
		elrsus += c;
	}

	return 0;
}
